Marcus-Davi/K64F-Nanook/board/boards/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BT_PINS
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BT_PINS(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTC14 (pin 86) is configured as UART4_RX */
    PORT_SetPinMux(BT_PINS_BT_RX_PORT, BT_PINS_BT_RX_PIN, kPORT_MuxAlt3);

    /* PORTC15 (pin 87) is configured as UART4_TX */
    PORT_SetPinMux(BT_PINS_BT_TX_PORT, BT_PINS_BT_TX_PIN, kPORT_MuxAlt3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
ENCODER_PINS:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '64', peripheral: GPIOB, signal: 'GPIO, 18', pin_signal: PTB18/CAN0_TX/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/FTM2_QD_PHA, direction: INPUT, gpio_interrupt: kPORT_InterruptRisingEdge}
  - {pin_num: '65', peripheral: GPIOB, signal: 'GPIO, 19', pin_signal: PTB19/CAN0_RX/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB, direction: INPUT}
  - {pin_num: '80', peripheral: GPIOC, signal: 'GPIO, 8', pin_signal: ADC1_SE4b/CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7, direction: INPUT, gpio_interrupt: kPORT_InterruptRisingEdge}
  - {pin_num: '71', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: ADC0_SE15/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FB_AD13/I2S0_TXD0, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ENCODER_PINS
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ENCODER_PINS(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t ENC_R_A_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 64)  */
    GPIO_PinInit(ENCODER_PINS_ENC_R_A_GPIO, ENCODER_PINS_ENC_R_A_PIN, &ENC_R_A_config);

    gpio_pin_config_t ENC_R_B_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 65)  */
    GPIO_PinInit(ENCODER_PINS_ENC_R_B_GPIO, ENCODER_PINS_ENC_R_B_PIN, &ENC_R_B_config);

    gpio_pin_config_t ENC_L_B_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(ENCODER_PINS_ENC_L_B_GPIO, ENCODER_PINS_ENC_L_B_PIN, &ENC_L_B_config);

    gpio_pin_config_t ENC_L_A_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 80)  */
    GPIO_PinInit(ENCODER_PINS_ENC_L_A_GPIO, ENCODER_PINS_ENC_L_A_PIN, &ENC_L_A_config);

    /* PORTB18 (pin 64) is configured as PTB18 */
    PORT_SetPinMux(ENCODER_PINS_ENC_R_A_PORT, ENCODER_PINS_ENC_R_A_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB18 (pin 64): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(ENCODER_PINS_ENC_R_A_PORT, ENCODER_PINS_ENC_R_A_PIN, kPORT_InterruptRisingEdge);

    /* PORTB19 (pin 65) is configured as PTB19 */
    PORT_SetPinMux(ENCODER_PINS_ENC_R_B_PORT, ENCODER_PINS_ENC_R_B_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 71) is configured as PTC1 */
    PORT_SetPinMux(ENCODER_PINS_ENC_L_B_PORT, ENCODER_PINS_ENC_L_B_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 80) is configured as PTC8 */
    PORT_SetPinMux(ENCODER_PINS_ENC_L_A_PORT, ENCODER_PINS_ENC_L_A_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC8 (pin 80): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(ENCODER_PINS_ENC_L_A_PORT, ENCODER_PINS_ENC_L_A_PIN, kPORT_InterruptRisingEdge);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
DRIVER_PINS:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '73', peripheral: UART1, signal: RX, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK}
  - {pin_num: '76', peripheral: UART1, signal: TX, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/FB_AD11/CMP1_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : DRIVER_PINS
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void DRIVER_PINS(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTC3 (pin 73) is configured as UART1_RX */
    PORT_SetPinMux(DRIVER_PINS_MOTOR_RX_PORT, DRIVER_PINS_MOTOR_RX_PIN, kPORT_MuxAlt3);

    /* PORTC4 (pin 76) is configured as UART1_TX */
    PORT_SetPinMux(DRIVER_PINS_MOTOR_TX_PORT, DRIVER_PINS_MOTOR_TX_PIN, kPORT_MuxAlt3);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART1TXSRC_MASK)))

                  /* UART 1 transmit data source select: UART1_TX pin. */
                  | SIM_SOPT5_UART1TXSRC(SOPT5_UART1TXSRC_UART_TX));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
IMU_PINS:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '82', peripheral: I2C1, signal: SCL, pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5, open_drain: enable, pull_select: no_init, pull_enable: disable}
  - {pin_num: '83', peripheral: I2C1, signal: SDA, pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b, open_drain: enable, pull_select: no_init,
    pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

